icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/camera.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		//  camera.c
 * Author:			//  baiyangmin
 * Date:			//  2013-07-08
 * Description:		//  拍照功能的实现，包括有:拍照，存储，以及相关接口函数，该文件实现了文件jt808_camera.c的拍照部分驱动功能
 * Version:			//  V0.01
 * Function List:	//  主要函数及其功能
 *     1. -------
 * History:			//  历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <dfs_posix.h>

#include "stm32f4xx.h"
#include "rs485.h"
#include "jt808.h"
#include "jt808_gps.h"
#include "jt808_util.h"
#include "camera.h"
#include "jt808_camera.h"
#include <finsh.h>
#include "sst25.h"
#include "jt808_config.h"

typedef enum
{
	CAM_NONE = 0, /*空闲*/
	CAM_IDLE,
	CAM_START,
	CAM_GET_PHOTO,
	CAM_RX_PHOTO,
	CAM_OK,
	CAM_FALSE,
	CAM_END
}CAM_STATE;

/*接收cam信息格式*/
typedef enum
{
	RX_IDLE = 0,
	RX_SYNC1,
	RX_SYNC2,
	RX_HEAD,
	RX_DATA,
	RX_FCS,
	RX_0D,
	RX_0A,
}CAM_RX_STATE;

typedef  __packed struct
{
	CAM_STATE				State;      ///处理过程状态，
	CAM_RX_STATE			Rx_State;   ///接收状态
	u8						Retry;      ///重复照相次数
	Style_Cam_Requset_Para	Para;       ///触发当前拍照相关信息
} Style_Cam_Para;


#define DF_CAM_REC_COUNT	4096        ///图片数据记录单元大小
#define DF_CAM_REC_MASK		0xFFFFF000  //每记录的掩码 ~(count-1)
#define DF_SECTOR_MASK 		0xFFFFF000       /*4K的地址掩码*/

extern rt_device_t _console_device;



static Style_Cam_Para	Current_Cam_Para;
TypeDF_PICPara	DF_PicParam;    ///FLASH存储的图片信息

/* 消息队列控制块*/
struct rt_messagequeue	mq_Cam;
/* 消息队列中用到的放置消息的内存池*/
static char				msgpool_cam[256];

#define PHOTO_RX_SIZE 1024

static uint8_t	photo_rx[PHOTO_RX_SIZE];
static uint16_t photo_rx_wr = 0;

extern MsgList	* list_jt808_tx;

/*保存单幅图片*/
static uint8_t photo_ram[32 * 1024] __attribute__( ( section( "CCM_RT_STACK" ) ) );


/*********************************************************************************
  *函数名称:u32 Cam_Flash_AddrCheck(u32 pro_Address)
  *功能描述:检查当前的位置是否合法，不合法就修改为合法数据并返回
  *输	入:none
  *输	出:none
  *返 回 值:正确的地址值
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static u32 Cam_Flash_AddrCheck( u32 pro_Address )
{
	while( pro_Address >= ADDR_DF_CAM_END )
	{
		pro_Address = pro_Address + ADDR_DF_CAM_START - ADDR_DF_CAM_END;
	}
	if( pro_Address < ADDR_DF_CAM_START )
	{
		pro_Address = ADDR_DF_CAM_START;
	}
	return pro_Address;
}


/*********************************************************************************
  *函数名称:u16 Cam_Flash_InitPara( u8 printf_info )
  *功能描述:初始化拍照相关存储参数
  			注意:该函数只能用来初始化存储区域，不可增加只能初始化一次的代码，不如不能初始化信号量
  			不能初始化线程等
  *输	入:printf_info	:0.表示不打印图片信息，1.打印图片信息
  *输	出:none
  *返 回 值:有效的图片数量
  *作	者:白养民
  *创建日期:2014-03-05
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 Cam_Flash_InitPara( u8 printf_info )
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;

	DF_PicParam.Number			= 0;
	DF_PicParam.NotSendCounter	= 0;
	DF_PicParam.First.Address	= ADDR_DF_CAM_START; /*没有有效地址*/
	DF_PicParam.First.Data_ID	= 0xFFFFFFFF;
	DF_PicParam.First.Len		= 0;

	DF_PicParam.Last.Address	= ADDR_DF_CAM_START;
	DF_PicParam.Last.Data_ID	= 0;
	DF_PicParam.Last.Len		= 0;
	if( printf_info )
	{
		rt_kprintf( "\nNO    ADDR        ID     LEN   NO_DEL\n" );
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_CAM_START; TempAddress < ADDR_DF_CAM_END; )
	{
		sst25_read( TempAddress, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
		if( TempPackageHead.Head == CAM_HEAD )                      /*有效数据*/
		{
			DF_PicParam.Number++;
			if((TempPackageHead.State & 0x03) == 0x03)
				DF_PicParam.NotSendCounter++;
			if( DF_PicParam.First.Data_ID >= TempPackageHead.id )   /*第一个应该是id最小的*/
			{
				DF_PicParam.First.Address	= TempAddress;
				DF_PicParam.First.Len		= TempPackageHead.Len;
				DF_PicParam.First.Data_ID	= TempPackageHead.id;
			}

			if( DF_PicParam.Last.Data_ID <= TempPackageHead.id )    /*最后一个应该是id最大的*/
			{
				DF_PicParam.Last.Address	= TempAddress;
				DF_PicParam.Last.Len		= TempPackageHead.Len;
				DF_PicParam.Last.Data_ID	= TempPackageHead.id;
			}

			if( printf_info )
			{
				rt_kprintf( "%05d 0x%08x  %05d  %04d  %d\n", DF_PicParam.Number, TempAddress, TempPackageHead.id, TempPackageHead.Len, TempPackageHead.State & ( BIT( 0 ) ) );
			}
			TempAddress += ( TempPackageHead.Len + DF_CAM_REC_COUNT - 1 ) & DF_CAM_REC_MASK;
		}else
		{
			TempAddress += DF_CAM_REC_COUNT;
		}
	}
	rt_sem_release( &sem_dataflash );
	return DF_PicParam.Number;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_WrPic(u8 *pData,u16 len, TypeDF_PackageHead *pHead)
  *功能描述:向FLASH中写入图片数据，如果传递的数据的pHead->len为非0值表示为最后一包数据
  *输	入:	pData:写入的数据指针，指向数据buf；
   len:数据长度，注意，该长度必须小于4096
   pHead:数据包头信息，该包头信息需要包含时间Timer，该值每次都必须传递，并且同样的包该值不能变化，
    最后一包数据需将len设置为数据长度len的长度包括包头部分，包头部分为固定64字节，其它包
    len为0.
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/

#define my_printf( X ) rt_kprintf( "\n%s=%d", # X, X )


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t Cam_Flash_SavePic( TypeDF_PackageHead * phead )
{
	uint32_t	len;
	uint32_t	addr;
	uint8_t		* p;

	len		= phead->Len;
	addr	= ( DF_PicParam.Last.Address + DF_PicParam.Last.Len + DF_CAM_REC_COUNT - 1 ) & DF_CAM_REC_MASK; /*4096对齐*/

	DF_PicParam.Last.Len	= len;
	DF_PicParam.Last.Address = Cam_Flash_AddrCheck(addr);
	DF_PicParam.Last.Data_ID++;
	DF_PicParam.Number++;
	DF_PicParam.NotSendCounter++;
	
