icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/camera.c
	phead->id = DF_PicParam.Last.Data_ID;
	memcpy( photo_ram, (uint8_t*)phead, sizeof(TypeDF_PackageHead) );
	p = photo_ram;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	while( 1 )
	{
		addr = Cam_Flash_AddrCheck( addr );
		sst25_erase_4k( addr );
		if( len > 4096 )
		{
			sst25_write_through( addr, p, 4096 );
			p		+= 4096;
			addr	+= 4096;
			len		-= 4096;
		}else
		{
			sst25_write_through( addr, p, len );
			break;
		}
	}
	rt_sem_release( &sem_dataflash );
	Cam_Flash_InitPara( 1 );
	return RT_EOK;
}



/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t Cam_Flash_SaveMediaData(uint32_t file_addr, uint8_t *p, uint16_t len)
{
	uint32_t	addr;
	
	addr	= ( DF_PicParam.Last.Address + DF_PicParam.Last.Len + DF_CAM_REC_COUNT - 1 ) & DF_CAM_REC_MASK; /*4096对齐*/
	if(len>4096)
		return RT_ERROR;
	
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	addr	+= file_addr;
	if((file_addr==0)&&(len==sizeof(TypeDF_PackageHead)))
		{
		sst25_write_through( addr, p, len );
		rt_sem_release( &sem_dataflash );
		Cam_Flash_InitPara( 1 );
		}
	else
		{
		sst25_erase_4k( addr );
		sst25_write_through( addr, p, len );
		rt_sem_release( &sem_dataflash );
		}
	return RT_EOK;
}


/*********************************************************************************
  *函数名称:u32 Cam_Flash_FindPicID(u32 id,TypeDF_PackageHead *p_head)
  *功能描述:从FLASH中查找指定ID的图片，并将图片包头新新存储在p_head中
  *输	入:	id			:多媒体ID号
   			p_head		:输出参数，输出为图片多媒体数据包头信息(类型为TypeDF_PackageHead)
   			search_state:表示查找的其他条件，BIT0 表示不查找删除的照片，BIT1表示不查找已经成功上传的照片
  *输	出:p_head
  *返 回 值:u32 0xFFFFFFFF表示没有找到图片，其它表示找到了图片，返回值为图片在flash中的地址
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:bai
  *修改日期:2013-06-23
  *修改描述:修改了拍照数据存储异常时的检索功能
*********************************************************************************/
u32 Cam_Flash_FindPicID( u32 id, TypeDF_PackageHead *p_head ,uint8_t search_state)
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;

	if( DF_PicParam.Number == 0 )
	{
		return 0xFFFFFFFF;
	}
	if( ( id < DF_PicParam.First.Data_ID ) || ( id > DF_PicParam.Last.Data_ID ) )
	{
		return 0xFFFFFFFF;
	}

	for( TempAddress = ADDR_DF_CAM_START; TempAddress < ADDR_DF_CAM_END; )
	{
		sst25_read( TempAddress, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
		if( TempPackageHead.Head == CAM_HEAD ) /*有效数据*/
		{
			if(( id == TempPackageHead.id )&&(TempPackageHead.State & search_state) == search_state)
			{
				memcpy( p_head, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
				return TempAddress;
			}
			TempAddress += ( TempPackageHead.Len + DF_CAM_REC_COUNT - 1 ) & DF_CAM_REC_MASK;
		}else
		{
			TempAddress += DF_CAM_REC_COUNT;
		}
	}
	return 0xFFFFFFFF;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_RdPic(void *pData,u16 *len, u32 id,u8 offset )
  *功能描述:从FLASH中读取图片数据
  *输	入:	pData:写入的数据指针，指向数据buf；
   len:返回的数据长度指针注意，该长度最大为512
   id:多媒体ID号
   offset:多媒体数据偏移量，从0开始，0表示读取多媒体图片包头信息，包头信息长度固定为64字节，采用
    结构体TypeDF_PackageHead格式存储
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-5
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_RdPic( void *pData, u16 *len, u32 id, u8 offset )
{
	u32					TempAddress;
	u32					temp_Len;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	*len = 0;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead ,0x00);
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto lbl_cam_flash_rdpic_ret;
	}

	if( offset > ( TempPackageHead.Len - 1 ) / 512 )
	{
		ret = RT_ENOMEM; goto lbl_cam_flash_rdpic_ret;
	}
	if( offset == ( TempPackageHead.Len - 1 ) / 512 )
	{
		temp_Len = TempPackageHead.Len - ( offset * 512 );
	}else
	{
		temp_Len = 512;
	}
	sst25_read( TempAddress + offset * 512, (u8*)pData, temp_Len );
	*len = temp_Len;

	ret = RT_EOK;

lbl_cam_flash_rdpic_ret:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_DelPic(u32 id)
  *功能描述:从FLASH中删除图片，实际上并没有删除，而是将删除标记清0，这样下次就再也不查询该图片
  *输	入:	id:多媒体ID号
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_DelPic( u32 id )
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	if( DF_PicParam.Number == 0 ) /*没有图片*/
	{
		return RT_EOK;
	}

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead ,BIT(0));
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	TempPackageHead.State &= ~( BIT( 0 ) );
	sst25_write_through( TempAddress, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
	ret = RT_EOK;

FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:rt_err_t Cam_Flash_TransOkSet(u32 id)
  *功能描述:将该ID的图片标记为发送成功
  *输	入:	id:多媒体ID号
  *输	出:none
  *返 回 值:re_err_t
  *作	者:白养民
  *创建日期:2013-06-13
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t Cam_Flash_TransOkSet( u32 id )
{
	u32					TempAddress;
	TypeDF_PackageHead	TempPackageHead;
	u8					ret;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = Cam_Flash_FindPicID( id, &TempPackageHead ,BIT(0)|BIT(1));
	if( TempAddress == 0xFFFFFFFF )
	{
		ret = RT_ERROR;  goto FUNC_RET;
	}
	TempPackageHead.State &= ~( BIT( 1 ) );
	sst25_write_through( TempAddress, (u8*)&TempPackageHead, sizeof( TypeDF_PackageHead ) );
	ret = RT_EOK;
	if(DF_PicParam.NotSendCounter)
		DF_PicParam.NotSendCounter--;
FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

	
/*********************************************************************************
  *函数名称:void* Cam_Flash_SearchPicHead( MYTIME start_time, MYTIME end_time, uint8_t channel, uint8_t trigger, uint16_t *findcount ,uint8_t search_state)
  *功能描述:查找指定时间范围内的图片头，并形成动态分配的记录和总的记录数
  			用于中心存储多媒体信息检索和终端显示图片信息
			注意检索条件
			注意输出顺序
			注意中间可能间断;
  *输	入: start_time	:	检索索引的开始时间
  			end_time	:	检索索引的结束时间
  			channel		:	拍照通道，0表示不区分通道
  			trigger		:	触发拍照的原因
  			findcount	:	为输入时表示需要查找的总数量
  			search_state:	表示查找的其他条件，BIT0 表示不查找删除的照片，BIT1表示不查找已经成功上传的照片
  *输	出: void*		:	如果查找到图片则返回该图片的数据头指针，并分配了空间，调用该函数时需要释放该资源；如果没有找到图片，则不需要释放，因为根本就没有分配资源
  			findcount	:	作为输出时表示实际查找到的图片数量
  *返 回 值:void*
  *作	者:郭智勇
  *创建日期:2013-06-13
  *---------------------------------------------------------------------------------
  *修 改 人:白养民
  *修改日期:2013-11-18
  *修改描述:增加了新输入参数search_state，同时增加了参数findcount的输入功能
*********************************************************************************/
void* Cam_Flash_SearchPicHead( MYTIME start_time, MYTIME end_time, uint8_t channel, uint8_t trigger, uint16_t *findcount ,uint8_t search_state)
{
	u16					i;
	TypeDF_PackageHead	TempPackageHead;

