icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/camera.c
	uint16_t			search_counter = *findcount;
	uint16_t			count = 0;
	uint32_t			addr;
	uint32_t			find_addr[100];         /*一百个图片够不够*/

	uint8_t				*p = RT_NULL;
	if(search_counter > 100)
		search_counter = 100;
	if(search_counter == 0)
		search_counter = 100;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );

	addr = DF_PicParam.First.Address;           /*从最新的开始*/
	for( i = 0; i < DF_PicParam.Number; i++ )
	{
		sst25_read( addr, (u8*)&TempPackageHead, sizeof( TempPackageHead ) );
		if( TempPackageHead.Head == CAM_HEAD )  /*有效数据*/
		{
			if( ( TempPackageHead.Time >= start_time ) && ( TempPackageHead.Time <= end_time ) )
			{
				if( ( channel == 0 ) || ( channel == TempPackageHead.Channel_ID ) )
				{
					if( ( trigger == 0xFF ) || ( trigger == TempPackageHead.TiggerStyle ) )
					{
						if((TempPackageHead.State & search_state) == search_state)
						{
							find_addr[count] = addr;
							count++;
							if(count >= search_counter)
								break;
						}
					}
				}
			}
			addr += ( TempPackageHead.Len + DF_CAM_REC_COUNT - 1 ) & DF_CAM_REC_MASK;
		}else
		{
			rt_kprintf( "\n数据错误" );
			addr += DF_CAM_REC_COUNT;
		}
	}

	if( count == 0 ) /*没有找到记录*/
	{
		goto lbl_search_pichead_end;
	}
	p = rt_malloc( count * sizeof( TypeDF_PackageHead ) );
	if( p == RT_NULL )
	{
		goto lbl_search_pichead_end;
	}
/*顺序填写找到的记录*/
	for( i = 0; i < count; i++ )
	{
		sst25_read( find_addr[i], p + i * sizeof( TempPackageHead ), sizeof( TempPackageHead ) );
	}

lbl_search_pichead_end:
	rt_sem_release( &sem_dataflash );
	*findcount = count;
	return p;
}


/*********************************************************************************
  *函数名称:void Cam_Device_init( void )
  *功能描述:初始化CAM模块相关接口
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_Device_init( void )
{
	///开电
	Power_485CH1_ON;

	///初始化消息队列
	rt_mq_init( &mq_Cam, "mq_cam", &msgpool_cam[0], sizeof( Style_Cam_Requset_Para ), sizeof( msgpool_cam ), RT_IPC_FLAG_FIFO );

	///初始化flash参数
	Cam_Flash_InitPara( 0 );

	///初始化照相状态参数
	memset( (u8*)&Current_Cam_Para, 0, sizeof( Current_Cam_Para ) );
	Current_Cam_Para.State = CAM_NONE;
}



/*********************************************************************************
  *函数名称:void cam_fact_set( void )
  *功能描述:格式化拍照存储区域
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-11-18
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void cam_fact_set( void )
{
	u32					TempAddress;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_CAM_START; TempAddress < ADDR_DF_CAM_END; )
	{
		sst25_erase_4k( TempAddress );
		TempAddress += 4096;
	}
	rt_sem_release( &sem_dataflash );
}
FINSH_FUNCTION_EXPORT( cam_fact_set, cam_fact_set );


/*********************************************************************************
  *函数名称:static void Cam_Start_Cmd(u16 Cam_ID)
  *功能描述:向camera模块发送开始拍照指令
  *输	入:Cam_ID	需要拍照的camera设备ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static void Cam_Start_Cmd( u16 Cam_ID )
{
	u8 Take_photo[10] = { 0x40, 0x40, 0x61, 0x81, 0x02, 0X00, 0X00, 0X02, 0X0D, 0X0A };                             //----  报警拍照命令
	Take_photo[4]	= (u8)Cam_ID;
	Take_photo[5]	= (u8)( Cam_ID >> 8 );
	RS485_write( Take_photo, 10 );
	//uart2_rxbuf_rd = uart2_rxbuf_wr;
	rt_kprintf( "\n%d>拍照=%d", rt_tick_get( ), Cam_ID );
}

/*********************************************************************************
  *函数名称:static void Cam_Read_Cmd(u16 Cam_ID)
  *功能描述:向camera模块发送读取照片数据指令
  *输	入:Cam_ID	需要拍照的camera设备ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static void Cam_Read_Cmd( u16 Cam_ID )
{
	uint8_t Fectch_photo[10] = { 0x40, 0x40, 0x62, 0x81, 0x02, 0X00, 0XFF, 0XFF, 0X0D, 0X0A }; //----- 报警取图命令
	Fectch_photo[4] = (u8)Cam_ID;
	Fectch_photo[5] = (u8)( Cam_ID >> 8 );
	RS485_write( Fectch_photo, 10 );
//	uart2_rxbuf_rd = uart2_rxbuf_wr;
	rt_kprintf( "\n%d>读照=%d", rt_tick_get( ), Cam_ID );
}

/*********************************************************************************
  *函数名称:TypeDF_PICPara Cam_get_param(void)
  *功能描述:获取系统拍照相关参数
  *输	入:none
  *输	出:none
  *返 回 值:TypeDF_PICPara
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
TypeDF_PICPara* Cam_get_param( void )
{
	return &DF_PicParam;
}

/*********************************************************************************
  *函数名称:rt_err_t take_pic_request( Style_Cam_Requset_Para *para)
  *功能描述:请求拍照指令
  *输	入:para拍照参数
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t take_pic_request( Style_Cam_Requset_Para *para )
{
	return rt_mq_send( &mq_Cam, (void*)para, sizeof( Style_Cam_Requset_Para ) );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void getpicpara( void )
{
	rt_kprintf( "\nFirst id=%d(addr=0x%x,len=%d)\nLast id=%d(addr=0x%x,len=%d)",
	            DF_PicParam.First.Data_ID,
	            DF_PicParam.First.Address,
	            DF_PicParam.First.Len,
	            DF_PicParam.Last.Data_ID,
	            DF_PicParam.Last.Address,
	            DF_PicParam.Last.Len );
}

