icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/camera.c
FINSH_FUNCTION_EXPORT( getpicpara, getpicpara );


/*********************************************************************************
  *函数名称:bool Camera_RX_Data(u16 *RxLen)
  *功能描述:拍照接收数据处理
  *输	入:RxLen:表示接收到得数据长度指针
  *输	出:RxLen:表示接收到得数据长度指针
  *返 回 值:0表示接收进行中,1表示接收成功
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
static u8 Camera_RX_Data( u16 *RxLen )
{
	u8			ch;
	static u16	page_size		= 0;
	static u16	cam_rx_head_wr	= 0;

	/*串口是否收到数据*/
	while( RS485_read_char( &ch ) )
	{
		//rt_kprintf("%02X",ch);
		switch( Current_Cam_Para.Rx_State )
		{
			case RX_DATA: /*保存信息格式: 位置(2B) 大小(2B) FLAG_FF 数据 0D 0A*/
				photo_rx[photo_rx_wr++] = ch;
				photo_rx_wr				%= UART2_RX_SIZE;
				if( photo_rx_wr == page_size )
				{
					Current_Cam_Para.Rx_State = RX_FCS;
					//rt_kprintf("\n CAM Rx_data=%d\n",photo_rx_wr);
				}
				break;
			case RX_IDLE:
				if( ch == 0x40 )
				{
					Current_Cam_Para.Rx_State = RX_SYNC1;
				}
				break;
			case RX_SYNC1:
				if( ch == 0x40 )
				{
					Current_Cam_Para.Rx_State = RX_SYNC2;
				} else
				{
					Current_Cam_Para.Rx_State = RX_IDLE;
				}
				break;
			case RX_SYNC2:
				if( ch == 0x63 )
				{
					cam_rx_head_wr				= 0;
					Current_Cam_Para.Rx_State	= RX_HEAD;
				}else
				{
					Current_Cam_Para.Rx_State = RX_IDLE;
				}
				break;
			case RX_HEAD:
				photo_rx[cam_rx_head_wr++] = ch;
				if( cam_rx_head_wr == 5 )
				{
					photo_rx_wr					= 0;
					page_size					= ( photo_rx[3] << 8 ) | photo_rx[2];
					Current_Cam_Para.Rx_State	= RX_DATA;
				}
				break;
			case RX_FCS:
				Current_Cam_Para.Rx_State = RX_0D;
				break;
			case RX_0D:
				if( ch == 0x0d )
				{
					Current_Cam_Para.Rx_State = RX_0A;
				} else
				{
					Current_Cam_Para.Rx_State = RX_IDLE;
				}
				break;
			case RX_0A:
				Current_Cam_Para.Rx_State = RX_IDLE;
				if( ch == 0x0a )
				{
					return 1;
				}
				break;
		}
	}
	return 0;
}

/*********************************************************************************
  *函数名称:void Cam_response_ok( struct _Style_Cam_Requset_Para *para,uint32_t pic_id )
  *功能描述:平台下发拍照命令处理函数的回调函数_单张照片拍照OK
  *输	入:	para	:拍照处理结构体
   pic_id	:图片ID
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_response_ok( struct _Style_Cam_Requset_Para *para, uint32_t pic_id )
{
	if( para->SendPhoto )
	{
		if(( gsm_socket[0].state == CONNECTED )&&(jt808_state == JT808_REPORT))
			{
			Cam_jt808_0x0800( pic_id, !para->SavePhoto );
			}
	}
}

/*********************************************************************************
  *函数名称:void Cam_response_end( struct _Style_Cam_Requset_Para *para )
  *功能描述:平台下发拍照命令处理函数的回调函数
  *输	入:	para	:拍照处理结构体
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-17
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_response_end( struct _Style_Cam_Requset_Para *para )
{
	return;
}

/*********************************************************************************
  *函数名称:void Camera_Process(void)
  *功能描述:进行照相相关处理(包括有:拍照，存储照片，发送拍照结束指令给808)
  *输	入:none
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-3
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/

u8 Camera_Process( void )
{
	u16							RxLen;
	static u16					cam_photo_size;
	static u8					cam_page_num	= 0;
	u8							cam_last_page	= 0;
	static uint32_t				photo_tick;
	static TypeDF_PackageHead	pack_head;
	static uint8_t				chn_id = 0;
	static uint8_t				power_cam_on = 1;
	u8							ch;
	char						temp_buf[32];

	switch( Current_Cam_Para.State )
	{
		case CAM_NONE:
			if( RT_EOK == rt_mq_recv( &mq_Cam, (void*)&Current_Cam_Para.Para, sizeof( Style_Cam_Requset_Para ), RT_WAITING_NO ) )
			{
				Power_485CH1_ON;
				Current_Cam_Para.State				= CAM_IDLE;
				Current_Cam_Para.Para.start_tick	= RT_TICK_PER_SECOND / 10 * 12 + rt_tick_get( );
				if( Current_Cam_Para.Para.Channel_ID == 0xFF ) /*多路拍照*/
				{
					chn_id = 1;
				}
				else
				{
					chn_id = Current_Cam_Para.Para.Channel_ID;
				}
				sprintf(temp_buf,"开始拍照,CH=%d",Current_Cam_Para.Para.Channel_ID);
				sd_write_console(temp_buf);
			}else
			{
				power_cam_on = 0;
				Power_485CH1_OFF;
				return 0;
			}
		case CAM_IDLE:
			if( (( rt_tick_get( ) > Current_Cam_Para.Para.start_tick )) && (( rt_tick_get( ) - Current_Cam_Para.Para.start_tick ) >= (Current_Cam_Para.Para.PhotoSpace * (u32)Current_Cam_Para.Para.PhotoNum)) )
			{
				Current_Cam_Para.Retry	= 0;
				Current_Cam_Para.State	= CAM_START;
			}
			break;
		case CAM_START: /*开始拍照*/
			cam_page_num	= 0;
			cam_photo_size	= 0;
			photo_tick		= rt_tick_get( );
			
			Cam_Start_Cmd( chn_id );
			
			pack_head.Channel_ID	= chn_id;
			pack_head.TiggerStyle	= Current_Cam_Para.Para.TiggerStyle;
			pack_head.Media_Format	= 0;
			pack_head.Media_Style	= 0;
			pack_head.Time			= mytime_now;
			pack_head.Head			= CAM_HEAD;
			pack_head.State			= 0xFF;
			pack_head.id			= DF_PicParam.Last.Data_ID + 1;
			memcpy( (uint8_t*)&( pack_head.position ), (uint8_t*)&gps_baseinfo, 28 );
			memset( photo_ram , 0xFF , 64);
			Current_Cam_Para.State		= CAM_RX_PHOTO;
			Current_Cam_Para.Rx_State	= RX_IDLE;
			break;
		case CAM_GET_PHOTO:
			photo_tick = rt_tick_get( );
			Cam_Read_Cmd( chn_id );
			Current_Cam_Para.State		= CAM_RX_PHOTO;
			Current_Cam_Para.Rx_State	= RX_IDLE;
			break;
		case CAM_RX_PHOTO:
			if( 1 == Camera_RX_Data( &RxLen ) )
			{
				photo_tick = rt_tick_get( );
				if( photo_rx_wr > 512 ) ///数据大于512,非法
				{
					rt_kprintf( "\nCAM%d invalided\n", chn_id );
					Current_Cam_Para.State = CAM_START;
					break;
				}
				if( photo_rx_wr == 512 )
				{
					if( ( photo_rx[510] == 0xff ) && ( photo_rx[511] == 0xD9 ) )
					{
						cam_last_page = 1;
					}
				}else
				{
					cam_last_page = 1;
				}

