icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/drivers/camera.c
				memcpy( photo_ram + cam_photo_size + 64, photo_rx, photo_rx_wr );   /*保存数据到sram*/
				cam_page_num++;
				cam_photo_size += photo_rx_wr;

				if( cam_last_page )                                                 ///最后一包数据，需要将长度写入。
				{
					pack_head.Len = cam_photo_size + 64;
					Cam_Flash_SavePic( &pack_head );
					Current_Cam_Para.State = CAM_OK;
				}else
				{
					Current_Cam_Para.State = CAM_GET_PHOTO;
				}
				photo_rx_wr = 0;
			}
			else if( rt_tick_get( ) - photo_tick > RT_TICK_PER_SECOND * 3 ) ///判读是否超时，启动拍照需要时间稍长
			//else if(( rt_tick_get( ) - photo_tick > RT_TICK_PER_SECOND * 3 )||((power_cam_on == 0)&&(cam_photo_size == 0))) ///判读是否超时，启动拍照需要时间稍长
			{
				Current_Cam_Para.Retry++;
				if( Current_Cam_Para.Retry >= 3 )
				{
					Current_Cam_Para.State = CAM_FALSE;
					rt_kprintf( "\n%d>拍照chn_%d失败", rt_tick_get( ), chn_id );
					Current_Cam_Para.Retry = 0;
				}else
				{
					Current_Cam_Para.State = CAM_START;
				}
			}
			if(Current_Cam_Para.State != CAM_OK)			///2013-11-18增加的内容，没有当拍照成功会给上位机发送两包图片数据
				break;
		case CAM_OK:
			//rt_kprintf( "\n%d>拍照成功!", rt_tick_get( ) );
			getpicpara( );
			sprintf(temp_buf,"拍照成功,CH=%d",chn_id);
			sd_write_console(temp_buf);
			//Current_Cam_Para.Para.start_tick = rt_tick_get( );

			if( Current_Cam_Para.Para.cb_response_cam_ok != RT_NULL )   ///调用单张照片拍照成功回调函数
			{
				Current_Cam_Para.Para.cb_response_cam_ok( &Current_Cam_Para.Para, pack_head.id );
			}else ///默认的回调函数
			{
				Cam_response_ok( &Current_Cam_Para.Para, pack_head.id );
			}
			////
			if( Current_Cam_Para.Para.Channel_ID == 0xFF )
			{
				if( chn_id == 4 )                                       /*四路完成*/
				{
					chn_id = 0;
					Current_Cam_Para.Para.PhotoNum++;		/*新增一轮图片拍照*/
				}
				chn_id++;
			}
			else
			{
				Current_Cam_Para.Para.PhotoNum++;			/*新增一张图片*/
			}
			if(Current_Cam_Para.Para.PhotoNum >= Current_Cam_Para.Para.PhotoTotal)
			{
				Current_Cam_Para.State = CAM_END;		///拍照任务完成
			}
			else
			{
				Current_Cam_Para.State=CAM_IDLE;		///单张照片拍照完成
			}
			break;
			////
		case CAM_FALSE:                                                 /*不管成功失败都要检查是否拍完，拍照失败要不要关电后再上电*/
			if( Current_Cam_Para.Para.Channel_ID == 0xFF )              /*多路拍摄*/
			{
				if( chn_id == 4 )                                       /*四路完成*/
				{
					chn_id = 0;
					Current_Cam_Para.Para.PhotoNum++;		/*新增一轮图片拍照*/
				}
				chn_id++;
				
				if( Current_Cam_Para.Para.PhotoNum >= Current_Cam_Para.Para.PhotoTotal )
				{
					Current_Cam_Para.State = CAM_END;                       ///拍照任务完成
				}else
				{
					Current_Cam_Para.State = CAM_IDLE;                      ///单张照片拍照完成
				}
			}
			else
			{
				Current_Cam_Para.State = CAM_END;
			}
			break;

		case CAM_END:
			rt_kprintf( "\n%d>拍照%x结束!", rt_tick_get( ), Current_Cam_Para.Para.Channel_ID );
			Current_Cam_Para.State = CAM_NONE;
			if( Current_Cam_Para.Para.cb_response_cam_end != RT_NULL )  ///调用单张照片拍照成功回调函数
			{
				Current_Cam_Para.Para.cb_response_cam_end( &Current_Cam_Para.Para );
			}else ///默认的回调函数
			{
				Cam_response_end( &Current_Cam_Para.Para );
			}
			break;
		default:
			Current_Cam_Para.State = CAM_NONE;
	}
	return 1;
}

/*********************************************************************************
  *函数名称:void Cam_takepic_ex(u16 id,u16 num,u16 space,u8 send,Style_Cam_Requset_Para trige)
  *功能描述:	拍照请求函数，
  *输	入:	id		:照相机ID范围为1-15
   num		:拍照数量
   space	:拍照间隔，单位为秒
   save	:是否保存图片到FLASH中
   send	:拍完后是否上传，1表示上传
   trige	:拍照触发源类型为	Style_Cam_Requset_Para
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_takepic_ex( u16 id, u16 num, u16 space, u8 save, u8 send, CAM_TRIGGER trige )
{
	Style_Cam_Requset_Para tempPara;
	if( trige > Cam_TRIGGER_OTHER )
	{
		trige = Cam_TRIGGER_OTHER;
	}
	memset( &tempPara, 0, sizeof( tempPara ) );
	tempPara.Channel_ID		= id;
	tempPara.PhotoSpace		= space * RT_TICK_PER_SECOND;
	tempPara.PhotoTotal		= num;
	tempPara.SavePhoto		= save;
	tempPara.SendPhoto		= send;
	tempPara.TiggerStyle	= trige;
	take_pic_request( &tempPara );
}

FINSH_FUNCTION_EXPORT( Cam_takepic_ex, para_id_num_space_save_send_trige );


/*********************************************************************************
  *函数名称:void Cam_takepic(u16 id,u8 send,Style_Cam_Requset_Para trige)
  *功能描述:	拍照请求函数，
  *输	入:	id		:照相机ID范围为1-15
   save	:是否保存图片到FLASH中
   send	:拍完后是否上传，1表示上传
   trige	:拍照触发源类型为	Style_Cam_Requset_Para
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_takepic( u16 chn_id, u8 save, u8 send, CAM_TRIGGER trige )
{
	Cam_takepic_ex( chn_id, 1, 0, save, send, trige );
}

FINSH_FUNCTION_EXPORT( Cam_takepic, take_pic );


/*********************************************************************************
  *函数名称:void Cam_get_All_pic(void)
  *功能描述:	获取图片数据，打印到调试串口
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-21
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void Cam_get_All_pic( void )
{
	Cam_Flash_InitPara( 1 );
}

FINSH_FUNCTION_EXPORT( Cam_get_All_pic, Cam_get_All_pic );


/*********************************************************************************
  *函数名称:void Cam_get_state(void)
  *功能描述:获取当前拍照的状态
  *输	入:	none
  *输	出:	none
  *返 回 值:uint8_t,0.表示没有拍照,1.表示处于拍照等待中,2表示正在拍照
  *作	者:白养民
  *创建日期:2014-02-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
uint8_t Cam_get_state(void)
{
	if(Current_Cam_Para.State == CAM_NONE )
		return 0;
	else if(Current_Cam_Para.State == CAM_IDLE )
		return 1;
	else
		return 2;
}

/************************************** The End Of File **************************************/
